/* jp.h for Japanese */
const char *PHONETIC_JAPANESE[] = {
    "(大)",                 /* IS UPPER CASE */
    "[ヘッダ開始]",         /* 01   SOA */
    "[テキスト開始]",       /* 02   STX */
    "[テキスト終了]",       /* 03   ETX */
    "[転送終了]",           /* 04   EOT */
    "[問い合わせ]",         /* 05   ENQ */
    "[肯定応答]",           /* 06   ACK */
    "[ベル]",               /* 07   BEL */
    "[1文字後退]",          /* 08   BS */
    "[水平タブ]",           /* 09   HT */
    "[改行]",               /* 10   LF */
    "[垂直タブ]",           /* 11   VT */
    "[改頁]",               /* 12   FF */
    "[復帰]",               /* 13   CR */
    "[シフトアウト]",       /* 14   SO */
    "[シフトイン]",         /* 15   SI */
    "[データリンク拡張]",   /* 16   DLE */
    "[装置制御1/XON]",      /* 17   DC1 */
    "[装置制御2]",          /* 18   DC2 */
    "[装置制御3/XOFF]",     /* 19   DC3 */
    "[装置制御4]",          /* 20   DC4 */
    "[否定応答]",           /* 21   NAK */
    "[同期信号]",           /* 22   SYN */
    "[ブロック転送終了]",   /* 23   ETB */
    "[キャンセル]",         /* 24   CAN */
    "[媒体終端]",           /* 25   EM */
    "[置換]",               /* 26   SUB */
    "[エスケープ]",         /* 27   ESC */
    "[ファイルセパレータ]", /* 28   FS */
    "[グループセパレータ]", /* 29   GS */
    "[レコードセパレータ]", /* 30   RS */
    "[ユニットセパレータ]", /* 31   US */
    "空白",             /* 32   SPACE */
    "びっくり",         /* 33   ! [感嘆符,雨垂れ,エクスクラメーションマーク] */
    "二重引用府",       /* 34   " [引用符] */
#ifdef KANJI
    "井",               /* 35   # */
    "弗",               /* 36   $ */
#else
    "シャープ",         /* 35   # [井] */
    "ドル",             /* 36   $ [弗] */
#endif
    "パーセント",       /* 37   % [百分率] */
    "アンド",           /* 38   & [アンパサンド] */
    "引用府",           /* 39   ' [アポストロフィー] */
    "左丸括弧",         /* 40   ( [パーレン] */
    "右丸括弧",         /* 41   ) */
#ifdef KANJI
    "米",               /* 42   * [星,水] */
    "足す",             /* 43   + [プラス] */
#else
    "アステリスク",     /* 42   * [星号] */
    "プラス",           /* 43   + [プラス] */
#endif
    "カンマ",           /* 44   , [コンマ] */
#ifdef KANJI
    "引く",             /* 45   - [マイナス,ハイフン] */
    "点",               /* 46   . [ドット,ピリオド] */
    "斜線",             /* 47   / [スラッシュ,スラント,ソリダス] */
#else
    "マイナス",         /* 45   - */
    "ドット",           /* 46   . */
    "スラッシュ",       /* 47   / */
#endif
    "零",               /* 48   0 */
#ifdef DAIJI
    "壹",               /* 49   1 */
    "貮",               /* 50   2 */
    "參",               /* 51   3 */
#elif KANJI
    "壱",               /* 49   1 */
    "弐",               /* 50   2 */
    "参",               /* 51   3 */
#else
    "一",               /* 49   1 */
    "二",               /* 50   2 */
    "三",               /* 51   3 */
#endif
#ifdef DAIJI
    "肆",               /* 52   4 */
    "伍",               /* 53   5 */
    "陸",               /* 54   6 */
    "柒",               /* 55   7 */
    "捌",               /* 56   8 */
    "玖",               /* 57   9 */
#else
    "四",               /* 52   4 */
    "五",               /* 53   5 */
    "六",               /* 54   6 */
    "七",               /* 55   7 */
    "八",               /* 56   8 */
    "九",               /* 57   9 */
#endif
    "コロン",           /* 58   : */
    "セミコロン",       /* 59   ; */
    "左山括弧",         /* 60   < [小なり] */
    "等号",             /* 61   = [イコール] */
    "右山括弧",         /* 62   > [大なり] */
    "はてな",           /* 63   ? [疑問符] */
#ifdef KANJI
    "単価",             /* 64   @ [アットマーク] */
#else
    "アットマーク",     /* 64   @ [アットマーク] */
#endif
    "左角括弧",         /* 91   [ [ブラケット] */
    "円",               /* 92   Yen */
    "右角括弧",         /* 93   ] */
    "山",               /* 94   ^ [サーカムフレックス] */
    "下線",             /* 95   _ [アンダースコア] */
    "バッククォート",   /* 96   ` [アクサングラーヴ,グレイヴ・アクセント] */
    "エイ",             /* 97   a */
    "ビー",             /* 98   b */
    "スィー",           /* 99   c */
    "ディー",           /* 100  d */
    "イー",             /* 101  e */
    "エフ",             /* 102  f */
    "ジー",             /* 103  g */
    "エイチ",           /* 104  h */
    "アイ",             /* 105  i */
    "ジェイ",           /* 106  j */
    "ケー",             /* 107  k */
    "エル",             /* 108  l */
    "エム",             /* 109  m */
    "エヌ",             /* 110  n */
    "オー",             /* 111  o */
    "ピー",             /* 112  p */
    "キュー",           /* 113  q */
    "アール",           /* 114  r [尺] */
    "エス",             /* 115  s */
    "ティー",           /* 116  t [丁] */
    "ユー",             /* 117  u */
    "ブイ",             /* 118  v */
    "ダブリュ",         /* 119  w */
    "エックス",         /* 120  x */
    "ワイ",             /* 121  y */
    "ゼット",           /* 122  z [乙] */
    "左中括弧",         /* 123  { [中括弧,ブレイス] */
    "パイプ",           /* 124  | */
    "右中括弧",         /* 125  } */
#ifdef KANJI
    "波",               /* 126  ~ [波線] */
#else
    "チルダ",           /* 126  ~ [波線] */
    "[削除]",           /* 127  DEL */
#endif
}; /* End of PHONETIC_JAPANESE */

